// Вывести квадрат числа
Console.Write("Введите число: ");
string num = Console.ReadLine();
int a = int.Parse(num);
int result = a * a;
Console.WriteLine(result);